Results/mongodb/load-threads-4-2.dat
YCSB Client 0.1
Command line: -db com.yahoo.ycsb.db.MongoDbClient -P /root/ycsb/config/mongodb.conf -P /root/ycsb/config/workload-ycsb-thomas -P /root/ycsb/config/workload-ycsb-thomas-load -s -load
 0 sec: 0 operations; 
new database url = 172.16.32.46:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.47:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.48:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.46:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.47:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.48:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.46:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.47:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.48:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.46:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.47:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.48:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.46:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.47:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.48:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.46:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.47:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.48:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.46:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.47:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.48:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.46:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.47:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.48:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.46:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.47:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.48:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.46:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.47:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.48:27017/ycsb
MongoDB type: Read: primary, Write: safe
 10 sec: 22906 operations; 2281.47 current ops/sec; [INSERT AverageLatency(us)=52226] 
 20 sec: 45776 operations; 2286.09 current ops/sec;  
 30 sec: 64461 operations; 1868.31 current ops/sec; [INSERT AverageLatency(us)=6108] 
 40 sec: 84218 operations; 1975.3 current ops/sec;  
 50 sec: 105994 operations; 2177.38 current ops/sec;  
 60 sec: 124861 operations; 1886.51 current ops/sec; [INSERT AverageLatency(us)=34522] 
 70 sec: 142217 operations; 1735.43 current ops/sec;  
 80 sec: 162603 operations; 2038.4 current ops/sec;  
 90 sec: 183247 operations; 2064.19 current ops/sec;  
 100 sec: 195673 operations; 1242.48 current ops/sec;  
 110 sec: 216312 operations; 2063.69 current ops/sec;  
 120 sec: 230834 operations; 1452.05 current ops/sec;  
 130 sec: 250069 operations; 1923.31 current ops/sec;  
 140 sec: 270506 operations; 2043.5 current ops/sec;  
 150 sec: 289300 operations; 1879.21 current ops/sec; [INSERT AverageLatency(us)=5272]  
 160 sec: 299720 operations; 1041.79 current ops/sec; [INSERT AverageLatency(us)=2400]  
 160 sec: 300000 operations; 478.63 current ops/sec;   
[OVERALL], RunTime(ms), 160644.0
[OVERALL], Throughput(ops/sec), 1867.4833793979233
[INSERT], Operations, 300000
[INSERT], AverageLatency(us), 15318.338003333334
[INSERT], MinLatency(us), 580
[INSERT], MaxLatency(us), 1859998
[INSERT], Return=0, 300000
[INSERT], 0, 35522.16649537513
[INSERT], 1000, 11770.029088050314
[INSERT], 2000, 9125.735200509229
[INSERT], 3000, 9571.912681271213
[INSERT], 4000, 11643.43691588785
[INSERT], 5000, 16762.158528428095
[INSERT], 6000, 13292.333968738087
[INSERT], 7000, 10066.565789473685
[INSERT], 8000, 11421.82145816073
[INSERT], 9000, 15221.525995316159
[INSERT], 10000, 10823.933623503808
[INSERT], 11000, 12754.932737335037
[INSERT], 12000, 12211.283612586842
[INSERT], 13000, 13033.079265562024
[INSERT], 14000, 12838.981115879827
[INSERT], 15000, 11677.20585996956
[INSERT], 16000, 12857.90776699029
[INSERT], 17000, 13051.608125819135
[INSERT], 18000, 18135.388483965016
[INSERT], 19000, 16111.67703568161
[INSERT], 20000, 14205.688816855754
[INSERT], 21000, 16184.232514177695
[INSERT], 22000, 11835.427196149218
[INSERT], 23000, 13531.478486997636
[INSERT], 24000, 18755.470210280375
[INSERT], 25000, 13311.82548227905
[INSERT], 26000, 12052.9639477242
[INSERT], 27000, 18187.235694050993
[INSERT], 28000, 55824.27433628318
[INSERT], 29000, 37845.22012578617
[INSERT], 30000, 31837.30115146147
[INSERT], 31000, 16085.144708423326
[INSERT], 32000, 12186.443181818182
[INSERT], 33000, 20413.674690508942
[INSERT], 34000, 12048.665989435189
[INSERT], 35000, 11085.099086757991
[INSERT], 36000, 14963.307852098047
[INSERT], 37000, 12829.791743119265
[INSERT], 38000, 14588.14338235294
[INSERT], 39000, 14661.889561270802
[INSERT], 40000, 21436.00824742268
[INSERT], 41000, 12584.715513536743
[INSERT], 42000, 11847.26323927329
[INSERT], 43000, 11223.272147147147
[INSERT], 44000, 13293.128761061947
[INSERT], 45000, 11552.543928153065
[INSERT], 46000, 18879.435736677115
[INSERT], 47000, 13418.747004608294
[INSERT], 48000, 14944.0295887663
[INSERT], 49000, 13025.391886240066
[INSERT], 50000, 12718.31596781025
[INSERT], 51000, 12764.554129225502
[INSERT], 52000, 13889.319218241042
[INSERT], 53000, 18861.35699517574
[INSERT], 54000, 20179.843060959793
[INSERT], 55000, 12107.303564584132
[INSERT], 56000, 11922.700680272108
[INSERT], 57000, 22604.53978978979
[INSERT], 58000, 22118.36038961039
[INSERT], 59000, 33635.51121794872
[INSERT], 60000, 44406.12554112554
[INSERT], 61000, 42814.74892241379
[INSERT], 62000, 20551.867847411446
[INSERT], 63000, 15122.634693877551
[INSERT], 64000, 15071.742453748782
[INSERT], 65000, 21636.67480258435
[INSERT], 66000, 11807.693789308176
[INSERT], 67000, 12633.736708860759
[INSERT], 68000, 12012.848582995952
[INSERT], 69000, 12540.133388912047
[INSERT], 70000, 12247.229922543824
[INSERT], 71000, 15687.913838120105
[INSERT], 72000, 15525.081632653062
[INSERT], 73000, 14715.103953147876
[INSERT], 74000, 15115.42035864979
[INSERT], 75000, 14413.512172714745
[INSERT], 76000, 13105.529411764706
[INSERT], 77000, 14939.07191780822
[INSERT], 78000, 15593.976531196337
[INSERT], 79000, 16911.164116094988
[INSERT], 80000, 14562.445991358618
[INSERT], 81000, 12331.82866556837
[INSERT], 82000, 13108.881066899869
[INSERT], 83000, 16825.12311977716
[INSERT], 84000, 12447.420941968041
[INSERT], 85000, 12190.89298743413
[INSERT], 86000, 12817.139159949087
[INSERT], 87000, 13545.414375301496
[INSERT], 88000, 26989.234774933804
[INSERT], 89000, 21201.576005453306
[INSERT], 90000, 16372.736612021858
[INSERT], 91000, 19973.53270397842
[INSERT], 92000, 11800.285936891312
[INSERT], 93000, 61766.52824858757
[INSERT], 95000, 83503.65512820512
[INSERT], 96000, 33901.45283018868
[INSERT], 97000, 22176.843272171252
[INSERT], 98000, 29960.7255859375
[INSERT], 99000, 13415.212092130518
[INSERT], 100000, 15797.290843806104
[INSERT], 101000, 16349.29626294462
[INSERT], 102000, 13631.7265625
[INSERT], 103000, 11759.49541704858
[INSERT], 104000, 15912.117511520737
[INSERT], 105000, 13624.345437171523
[INSERT], 106000, 18633.8952150212
[INSERT], 107000, 13405.678181023175
[INSERT], 108000, 13583.183664259928
[INSERT], 109000, 17318.677304964538
[INSERT], 110000, 20905.889895470384
[INSERT], 111000, 17327.102782509937
[INSERT], 112000, 15336.54982115483
[INSERT], 113000, 18701.371078806427
[INSERT], 114000, 17442.636609071273
[INSERT], 115000, 35417.56531791908
[INSERT], 116000, 49123.49082568807
[INSERT], 117000, 13605.734785036293
[INSERT], 118000, 21013.79609690444
[INSERT], 119000, 20090.506493506495
[INSERT], 120000, 16263.008492569003
[INSERT], 121000, 13684.472960586618
[INSERT], 122000, 13439.578971119134
[INSERT], 123000, 14318.383432539682
[INSERT], 124000, 17956.921749136938
[INSERT], 125000, 15126.177720207254
[INSERT], 126000, 24024.94609375
[INSERT], 127000, 16144.231707317073
[INSERT], 128000, 14443.936589948333
[INSERT], 129000, 14295.216563541171
[INSERT], 130000, 14276.09709762533
[INSERT], 131000, 14905.052097740894
[INSERT], 132000, 17535.939884393065
[INSERT], 133000, 13436.553172475424
[INSERT], 134000, 11592.360520094562
[INSERT], 135000, 14043.705965241898
[INSERT], 136000, 14627.526518804243
[INSERT], 137000, 18066.032987171657
[INSERT], 138000, 12353.40202020202
[INSERT], 139000, 18632.843628269336
[INSERT], 140000, 15639.752427184467
[INSERT], 141000, 16582.7507525587
[INSERT], 142000, 15353.665084388185
[INSERT], 143000, 12424.581781580271
[INSERT], 144000, 10685.808978032474
[INSERT], 145000, 9437.30330882353
[INSERT], 146000, 8026.254660848869
[INSERT], 147000, 9342.885714285714
[INSERT], 148000, 13853.88533988534
[INSERT], 149000, 18827.662369057212
[INSERT], 150000, 15443.910953506698
[INSERT], 151000, 49735.46920821114
[INSERT], 152000, 30824.771708683475
[INSERT], 153000, 21250.32730923695
[INSERT], 154000, 14426.837026447463
[INSERT], 155000, 11749.708807669263
[INSERT], 156000, 12763.915004336513
[INSERT], 157000, 16430.900402414485
[INSERT], 158000, 12043.283783783783
[INSERT], 159000, 6441.361111111111
[INSERT], 160000, 4624.857142857143
[CLEANUP], Operations, 30
[CLEANUP], AverageLatency(us), 2453.3
[CLEANUP], MinLatency(us), 1346
[CLEANUP], MaxLatency(us), 5594
[CLEANUP], 0, 3764.0
[CLEANUP], 1000, 3224.0
[CLEANUP], 2000, 4047.3333333333335
[CLEANUP], 3000, 1927.0
[CLEANUP], 5000, 4008.0
[CLEANUP], 15000, 2377.0
[CLEANUP], 16000, 2355.3333333333335
[CLEANUP], 17000, 1938.8
[CLEANUP], 18000, 1960.25
[CLEANUP], 19000, 2110.6666666666665
java -cp /root/ycsb/YCSB/mongodb/target/mongodb-binding-0.1.4.jar:/root/ycsb/YCSB/mongodb/target/archive-tmp/mongodb-binding-0.1.4.jar:/root/ycsb/YCSB/hbase/src/main/conf:/root/ycsb/YCSB/nosqldb/src/main/conf:/root/ycsb/YCSB/jdbc/src/main/conf:/root/ycsb/YCSB/jdbc/src/main/conf/postgresql-9.3-1100.jdbc41.jar:/root/ycsb/YCSB/infinispan/src/main/conf:/root/ycsb/YCSB/dynamodb/conf:/root/ycsb/YCSB/core/target/core-0.1.4.jar:/root/ycsb/YCSB/gemfire/src/main/conf:/root/ycsb/YCSB/voldemort/src/main/conf com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MongoDbClient -P /root/ycsb/config/mongodb.conf -P /root/ycsb/config/workload-ycsb-thomas -P /root/ycsb/config/workload-ycsb-thomas-load -s -load